//Шаблони проєктування — це набір класичних рішень, що групуються в три основні категорії: структурні, поведінкові та шаблони, що породжують.
// Структурні шаблони полегшують дизайн, спрощують визначення класів та їх взаємодії.
// Поведінкові шаблони займаються ефективною комунікацією та завданнями управління між об'єктами.
// Шаблони, що породжують пропонують рішення, які полегшують процес створення об'єктів.
// import "./singleton";
// import "./factory";
// import "./builder";
// import "./adapter";
// import "./decorator";
// import "./facade";
import "./state";
//# sourceMappingURL=index.js.map