// Синглтон — це породжуючий патерн проєктування, який гарантує, що клас має лише один екземпляр і надає глобальну точку доступу до цього екземпляру.

// Суть синглтона полягає в тому, щоб зробити конструктор класу приватним, тим самим запобігаючи пряме створення об'єктів класу. Замість цього, клас сам створює один об'єкт і зберігає його у статичному полі. Після цього клас завжди повертає цей же об'єкт.

class App {
  private static instance: App;

  constructor() {
    if (!App.instance) {
      App.instance = this;
    }

    return App.instance;
  }
}

export {};
